problem link: https://leetcode.com/problems/combine-two-tables/?lang=pythondata

In [ ]:
import pandas as pd

### Generating test cases

In [15]:
person=pd.read_csv('./test_data/person.csv',delimiter='|')
person

   personId lastName firstName
0         1     Wang     Allen
1         2    Alice       Bob

In [16]:
person.dtypes

personId      int64
lastName     object
firstName    object
dtype: object

In [17]:
person.columns

Index(['personId', 'lastName', 'firstName'], dtype='object')

In [18]:
address=pd.read_csv('./test_data/address.csv',delimiter='|')
address

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [19]:
address.dtypes

addressId     int64
personId      int64
city         object
state        object
dtype: object

In [20]:
address.columns

Index(['addressId', 'personId', 'city', 'state'], dtype='object')

### Solving problem

In [23]:
result=person.merge(address,how='left',on='personId')
result

   personId lastName firstName  addressId           city     state
0         1     Wang     Allen        NaN            NaN       NaN
1         2    Alice       Bob        1.0  New York City  New York

In [24]:
result[['firstName', 'lastName', 'city', 'state']]

  firstName lastName           city     state
0     Allen     Wang            NaN       NaN
1       Bob    Alice  New York City  New York

### Preparing Submission function

In [26]:
def combine_two_tables(person: pd.DataFrame, address: pd.DataFrame) -> pd.DataFrame:
    combined=person.merge(address,how='left',on='personId')

    return combined[['firstName', 'lastName', 'city', 'state']]

### Testing the submission function

In [27]:
combine_two_tables(person=person,address=address)

  firstName lastName           city     state
0     Allen     Wang            NaN       NaN
1       Bob    Alice  New York City  New York